{
  "home": "الرئيسية",
  "name": "من نحن",
  "title": "من نحن",
  "description": "هذا وصف عني",
  "hero_title": "نحن نغير مفهوم الأكل الصحي في جميع أنحاء العالم",
  "hero_content": "تأسست شركة أبو عوف في عام 2010 وأصبحت من أشهر الأسماء في الأسواق لتقديم منتجات القهوة الطبيعية عالية الجودة والمكسرات وزبد المكسرات والأطعمة الصحية والفاكهة المجففة.. وأكثر فلكل مُنتَج حكايته الخاصة؛ وبسبب اهتمامنا المستمر بالتفاصيل، فإن كل خطوة في عملية الإنتاج في أبو عوف تُدار بعناية لضمان إنتاج منتجات عالية الجودة يتم توصيلها بحب وملئها بالمكونات المغذية من الطبيعة الأم نعطي الأولوية لابتكار المنتجات ونأخذ في الاعتبار اتجاهات السوق ورغبات العملاء وتغيُّر الأذواق، كما نشجع دائمًا نمط الحياة الصحي؛ لأن هدفنا ليس فقط تغذية الجسم، بل تغذية العقل والروح أيضًا، وذلك من خلال مجموعة متنوعة من الأعشاب والمنتجات العضوية المختلفة. نأمل في حكي قصة التغيير الذي يمكنك إحداثه في العالم عندما تقوم بتغيير عادات الأكل الخاصة بك إلى عادات صحية وممتعة ولذيذة.",
  "history_title": "رحلة نجاح أبو عوف",
  "value_title": "قيم أبو عوف",
  "mission_title": "المهمة والرؤية",
  "mission_content": "'أبو عوف تم تأسيسها برؤية لتغيير مستقبل الغذاء. فمن قال أن الغذاء الصحي لا يمكن أن يكون لذيذًا؟'",
  "now": "أبو عوف حاليًا",
  "now_content": " لدينا الآن أكثر من 150 فرعًا في مصر ويمكن العثور على منتجاتنا في معظم محلات السوبر ماركت الكبرى في مثل كارفور ومترو وأولاد رجب وبنده وأوسكار وسعودي وهايبر وان وسبينسكما نقوم بتوريد العديد من منتجاتنا إلى مجموعة من أفخم سلاسل الفنادق مثل سانت ريجيس وفور سيزونز وجي دبليو ماريوت وماريوت ولو ميريديان وريتز كارلتون وويستن، بالإضافة إلى شركة السوق الحرة وشركة مصر للطيران التي نمدها بمنتجاتنا لأكثر من 10 سنوات.أخيرًا وليس آخرًا، ونظرًا لأننا نريد التأكد من أنك دائمًا مستيقظ ولديك كمية جيدة من الطاقة على الطريق، لذا نقدم قهوة أبو عوف التركية الخاصة في 55 محطة وقود ويمكن أيضًا العثور على شاي بالنكهات في 20 محطةنتأكد من تلبية ذوق كل عميل ونوفر مجموعة متنوعة من المنتجات التي لا غنى عنها للاستهلاك اليومي من المأكولات والمشروبات، مثل القهوة والشاي والعسل ... إلخ. فـ'أبو عوف' هو العلامة التجارية المفضلة في سوق الوجبات الخفيفة الصحية واللذيذة، حيث ونوفر وصولاً سهلاً إلى طعام صحي ونشجع أسلوب حياة صحي "
}
